
## Plan Result (pocket-router-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/7100)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 1 to change, 1 to destroy.</code></pre>

* Create
  * local_file.application_ecs_service_appspec_94386B9C
* Update
  * aws_synthetics_canary.synthetics_synthetics_synthetic_check_uptime_0_4168D0DB
* Replace
  * aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 must be replaced
-/+ resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/PocketRouter-Prod:1" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/PocketRouter-Prod" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ environment            = [
                        # (3 unchanged elements hidden)
                        {
                            name  = "PORT"
                            value = "4000"
                        },
                      ~ {
                            name  = "RELEASE_SHA"
                          ~ value = "3834b7e5dbc6a251ce25ff16eefc47b8a79c42cf" -> "46d6c68f14be272872ef74f9d76b31a160486616"
                        },
                    ]
                    name                   = "app"
                    # (10 unchanged attributes hidden)
                },
              ~ {
                    name                   = "aws-otel-collector"
                  ~ portMappings           = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                    # (10 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "PocketRouter-Prod" -> (known after apply)
      ~ revision                 = 1 -> (known after apply)
        tags                     = {
            "environment" = "Prod"
            "service"     = "PocketRouter"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_synthetics_canary.synthetics_synthetics_synthetic_check_uptime_0_4168D0DB will be updated in-place
  ~ resource "aws_synthetics_canary" "synthetics_synthetics_synthetic_check_uptime_0_4168D0DB" {
        id                       = "router-prod-uptime-0"
        name                     = "router-prod-uptime-0"
        tags                     = {}
        # (16 unchanged attributes hidden)

      ~ run_config {
          ~ environment_variables = {
              ~ "UPTIME_URL"  = "pocket-router.getpocket.com:4000/.well-known/apollo/server-health" -> "pocket-router.getpocket.com/.well-known/apollo/server-health"
                # (1 unchanged element hidden)
            }
            # (3 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # local_file.application_ecs_service_appspec_94386B9C will be created
  + resource "local_file" "application_ecs_service_appspec_94386B9C" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

Plan: 2 to add, 1 to change, 1 to destroy.
╷
│ Warning: Deprecated attribute
│ 
│   on cdk.tf.json line 1842, in resource.aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84:
│ 1842:         "endpoint": "https://events.pagerduty.com/integration/${pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5.integration_key}/enqueue",
│ 
│ The attribute "integration_key" is deprecated. Refer to the provider
│ documentation for details.
│ 
│ (and 3 more similar warnings elsewhere)
╵
```

</details>



## :warning: Warnings

```hcl
Warning: Deprecated attribute
 
   on cdk.tf.json line 1842, in resource.aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84:
 1842:         "endpoint": "https://events.pagerduty.com/integration/${pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5.integration_key}/enqueue",
 
 The attribute "integration_key" is deprecated. Refer to the provider
 documentation for details.
 
 (and 3 more similar warnings elsewhere)
```



<!-- github-comment: {"Command":"plan","JobID":"139137bc-5d2a-47d6-8ae9-554097696a3d","JobName":"pocket-router_infrastructure_plan_prod","PRNumber":46,"Program":"tfcmt","SHA1":"46d6c68f14be272872ef74f9d76b31a160486616","Target":"pocket-router-cdk","Vars":{}} -->